jmeter-tests/jmeter-booking.log
2026-05-05 20:01:11,515 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-05 20:01:11,545 INFO o.a.j.JMeter: Loading user properties from: C:\Apache\JMeter\bin\user.properties
2026-05-05 20:01:11,546 INFO o.a.j.JMeter: Loading system properties from: C:\Apache\JMeter\bin\system.properties
2026-05-05 20:01:11,546 INFO o.a.j.JMeter: Setting JMeter property: host=localhost
2026-05-05 20:01:11,546 INFO o.a.j.JMeter: Setting JMeter property: port=8080
2026-05-05 20:01:11,546 INFO o.a.j.JMeter: Setting JMeter property: contextPath=/re-center
2026-05-05 20:01:11,557 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: Version 5.6.3
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: java.version=17.0.18
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: os.name=Windows 11
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: os.arch=amd64
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: os.version=10.0
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: file.encoding=Cp1251
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-05 20:01:11,558 INFO o.a.j.JMeter: Available Processors =8
2026-05-05 20:01:11,570 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-05 20:01:11,571 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-05 20:01:11,571 INFO o.a.j.JMeter: JMeterHome=C:\Apache\JMeter
2026-05-05 20:01:11,571 INFO o.a.j.JMeter: user.dir  =C:\Users\Julfy\Desktop\re-center-rewrite
2026-05-05 20:01:11,571 INFO o.a.j.JMeter: PWD       =C:\Users\Julfy\Desktop\re-center-rewrite
2026-05-05 20:01:16,657 INFO o.a.j.JMeter: IP: 192.168.25.27 Name: DESKTOP-CHGIGO0 FullName: DESKTOP-CHGIGO0
2026-05-05 20:01:16,685 INFO o.a.j.s.FileServer: Default base='C:\Users\Julfy\Desktop\re-center-rewrite'
2026-05-05 20:01:16,687 INFO o.a.j.s.FileServer: Set new base='C:\Users\Julfy\Desktop\re-center-rewrite\lab4\jmeter-tests'
2026-05-05 20:01:16,959 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-05 20:01:17,008 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-05 20:01:17,013 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-05 20:01:17,018 INFO o.a.j.s.SaveService: Loading file: C:\Users\Julfy\Desktop\re-center-rewrite\lab4\jmeter-tests\recenter-lab4-booking.jmx
2026-05-05 20:01:17,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:01:17,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:01:17,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:01:17,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-05 20:01:17,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-05 20:01:17,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-05 20:01:17,301 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-05 20:01:17,314 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-05 20:01:17,314 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-05 20:01:17,314 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-05 20:01:17,320 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-05 20:01:17,320 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-05 20:01:17,617 INFO o.a.j.JMeter: Running test (1778000477616)
2026-05-05 20:01:17,632 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 5 Booking Users
2026-05-05 20:01:17,633 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group 5 Booking Users.
2026-05-05 20:01:17,633 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-05 20:01:17,633 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=30 delayedStart=false
2026-05-05 20:01:17,646 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-05 20:01:17,646 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-05 20:01:17,655 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-1
2026-05-05 20:01:17,657 INFO o.a.j.s.FileServer: Stored: lab4-users.csv
2026-05-05 20:01:20,689 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-CHGIGO0
2026-05-05 20:01:20,699 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-05 20:01:20,701 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-05 20:01:20,701 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-05 20:01:20,701 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-05 20:01:20,701 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-05 20:01:23,649 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-2
2026-05-05 20:01:29,649 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-3
2026-05-05 20:01:30,265 INFO o.a.j.r.Summariser: summary +      8 in 00:00:13 =    0.6/s Avg:   191 Min:     3 Max:   704 Err:     5 (62.50%) Active: 3 Started: 3 Finished: 0
2026-05-05 20:01:35,646 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-4
2026-05-05 20:01:41,646 INFO o.a.j.t.JMeterThread: Thread started: 5 Booking Users 1-5
2026-05-05 20:02:00,047 INFO o.a.j.r.Summariser: summary +     63 in 00:00:30 =    2.1/s Avg:    18 Min:     2 Max:   126 Err:    49 (77.78%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:02:00,048 INFO o.a.j.r.Summariser: summary =     71 in 00:00:42 =    1.7/s Avg:    37 Min:     2 Max:   704 Err:    54 (76.06%)
2026-05-05 20:02:30,335 INFO o.a.j.r.Summariser: summary +     74 in 00:00:30 =    2.4/s Avg:    15 Min:     2 Max:   120 Err:    57 (77.03%) Active: 5 Started: 5 Finished: 0
2026-05-05 20:02:30,336 INFO o.a.j.r.Summariser: summary =    145 in 00:01:13 =    2.0/s Avg:    26 Min:     2 Max:   704 Err:   111 (76.55%)
2026-05-05 20:02:56,979 INFO o.a.j.r.ResultCollector: Shutdown hook started
2026-05-05 20:02:56,980 INFO o.a.j.r.ResultCollector: Shutdown hook ended